---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanRunTopElevation
source: html/5aa60856-8737-395d-8870-087f67c1da66.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ExtendBelowBaseGreaterThanRunTopElevation Property

Extend Below Base needs to be less than Run Top Elevation.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtendBelowBaseGreaterThanRunTopElevation { get; }
```